Roberto-Rod/OCC_Main/arm1_mcu_firmware/Faster_FexIO/boards/evkmimxrt1170/apps/arm1_dev_kit/board/pin_mux.c
    /* I2C-A */
    SETUP(IOMUXC_GPIO_LPSR_04_LPI2C5_SDA, 1, LPSR_ODE + LPSR_PULL_NONE + LPSR_DRV_NORM + LPSR_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_LPSR_05_LPI2C5_SCL, 1, LPSR_ODE + LPSR_PULL_NONE + LPSR_DRV_NORM + LPSR_SLEW_SLOW);

    /* QSPI */
    SETUP(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_A_DQS,    1, SD_PULL_UP + SD_DRV_HI);
    SETUP(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B,  0, SD_PULL_DOWN + SD_DRV_NORM);
    SETUP(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_A_SCLK,   0, SD_PULL_DOWN + SD_DRV_NORM);
    SETUP(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_A_DATA00, 0, SD_PULL_DOWN + SD_DRV_NORM);
    SETUP(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_A_DATA01, 0, SD_PULL_DOWN + SD_DRV_NORM);
    SETUP(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_A_DATA02, 0, SD_PULL_DOWN + SD_DRV_NORM);
    SETUP(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_A_DATA03, 0, SD_PULL_DOWN + SD_DRV_NORM);

    /* SDRAM */
    // Skip as it is done either by debug script or DCD. See BOARD_InitSEMCPins() below.

    /* ENET (100/10Mbit Ethernet-PHY Adapter)
     *
     * ENET_INT: GPIO3.25
     * ENET_RST: GPIO9.26
     */
    SETUPG(IOMUXC_GPIO_AD_26_GPIO_MUX3_IO25,     0, AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW, GPIO3, 25, input);    /* BOARD_MIPI_PANEL_TOUCH_INT */
    SETUPG(IOMUXC_GPIO_AD_27_GPIO9_IO26,         0, AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW, GPIO9, 26, out_high); /* BOARD_MIPI_PANEL_TOUCH_RST */
    SETUP(IOMUXC_GPIO_AD_32_ENET_MDC,            0, AD_PULL_DOWN + AD_DRV_HI + AD_SLEW_FAST);
    SETUP(IOMUXC_GPIO_AD_33_ENET_MDIO,           0, AD_PULL_DOWN + AD_DRV_HI + AD_SLEW_FAST);
    SETUP(IOMUXC_GPIO_DISP_B2_02_ENET_TX_DATA00, 0, DISP_B2_PULL_NONE + DISP_B2_DRV_HI + DISP_B2_SLEW_FAST);
    SETUP(IOMUXC_GPIO_DISP_B2_03_ENET_TX_DATA01, 0, DISP_B2_PULL_NONE + DISP_B2_DRV_HI + DISP_B2_SLEW_FAST);
    SETUP(IOMUXC_GPIO_DISP_B2_04_ENET_TX_EN,     0, DISP_B2_PULL_NONE + DISP_B2_DRV_HI + DISP_B2_SLEW_FAST);
    SETUP(IOMUXC_GPIO_DISP_B2_05_ENET_REF_CLK,   1, DISP_B2_PULL_NONE + DISP_B2_DRV_HI + DISP_B2_SLEW_FAST);
    SETUP(IOMUXC_GPIO_DISP_B2_06_ENET_RX_DATA00, 0, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI + DISP_B2_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_DISP_B2_07_ENET_RX_DATA01, 0, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI + DISP_B2_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_DISP_B2_08_ENET_RX_EN,     0, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI + DISP_B2_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_DISP_B2_09_ENET_RX_ER,     0, DISP_B2_PULL_DOWN + DISP_B2_DRV_HI + DISP_B2_SLEW_SLOW);
    IOMUXC_GPR->GPR4 = ((IOMUXC_GPR->GPR4
            & (~(IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR_MASK))) /* Mask bits to zero which are setting */
            | IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR(0x01U) /* ENET_REF_CLK direction control: 0x01U */
    );

    /* ENET 1G (Onboard PHY)
     *
     * ENET_INT: GPIO13.9
     * ENET_RST: GPIO13.10
     * ENET_WOL: GPIO13.11  (never used but declared)
     */
    SETUP(IOMUXC_GPIO_DISP_B1_00_ENET_1G_RX_EN,     0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_01_ENET_1G_RX_CLK,    0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_02_ENET_1G_RX_DATA00, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_03_ENET_1G_RX_DATA01, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_04_ENET_1G_RX_DATA02, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_05_ENET_1G_RX_DATA03, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_06_ENET_1G_TX_DATA03, 0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_07_ENET_1G_TX_DATA02, 0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_08_ENET_1G_TX_DATA01, 0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_09_ENET_1G_TX_DATA00, 0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_10_ENET_1G_TX_EN,     0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_11_ENET_1G_TX_CLK_IO, 0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_EMC_B2_19_ENET_1G_MDC,        0U, EMC_PULL_DOWN + EMC_DRV_HI);
    SETUP(IOMUXC_GPIO_EMC_B2_20_ENET_1G_MDIO,       0U, EMC_PULL_DOWN + EMC_DRV_HI);
    SETUPG(IOMUXC_GPIO_SNVS_06_DIG_GPIO13_IO09, 1, SNVS_PULL_UP   + SNVS_DRV_NORM + SNVS_SLEW_SLOW, GPIO13,  9, input);   /* RGMII_PHY_INTB */
    SETUPG(IOMUXC_GPIO_SNVS_07_DIG_GPIO13_IO10, 1, SNVS_PULL_NONE + SNVS_DRV_NORM + SNVS_SLEW_SLOW, GPIO13, 10, out_high);/* ETHPHY_RST_B */
    SETUPG(IOMUXC_GPIO_SNVS_08_DIG_GPIO13_IO11, 1, SNVS_PULL_UP   + SNVS_DRV_NORM + SNVS_SLEW_SLOW, GPIO13, 11, input);   /* ENET_RGMII_WOL */

    /* MIPI */
    //SETUP(IOMUXC_GPIO_AD_02_GPIO9_IO01,       0U, 0x04U); // Was BOARD_MIPI_PANEL_RST_GPIO but is now controlled with PCA6416 (PCA_LCD_DISP_MIPI_RST)
    //SETUP(IOMUXC_GPIO_AD_30_GPIO9_IO29,       0U, 0x04U); // Was BOARD_MIPI_PANEL_BL_GPIO but is now controlled with PCA6416 (PCA9530_LED0)
    //SETUP(IOMUXC_GPIO_DISP_B2_15_GPIO11_IO16, 0U, 0x04U); // Was BOARD_MIPI_PANEL_POWER_GPIO but is now controlled with PCA6416 (PCA_LCD_BL_PWR)

    /* SPI */
    SETUP(IOMUXC_GPIO_AD_28_LPSPI1_SCK,       0U, AD_DRV_HI + AD_PULL_NONE + AD_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_AD_29_LPSPI1_PCS0,      0U, AD_DRV_HI + AD_PULL_NONE + AD_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_AD_30_LPSPI1_SOUT,      0U, AD_DRV_HI + AD_PULL_NONE + AD_SLEW_SLOW);
    SETUP(IOMUXC_GPIO_AD_31_LPSPI1_SIN,       0U, AD_DRV_HI + AD_PULL_NONE + AD_SLEW_SLOW);

    /* From Hello World */
    SETUP(IOMUXC_GPIO_LPSR_11_ARM_TRACE_SWO, 0, LPSR_PULL_NONE + LPSR_DRV_HI + LPSR_SLEW_SLOW); // Was IOMUXC_GPIO_DISP_B2_07_ARM_TRACE_SWO
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins_uCOM_Carrier_Board
 * Description   : Initializes pins available on the uCOM Carrier Board
 *
 * END ****************************************************************************************************************/
static void BOARD_InitPins_uCOM_Carrier_Board(void) {
    if (first_time_calling) {
        first_time_calling = false;
        BOARD_InitPins_uCOM_Board();

        /* SW5/WAKEUP button */
        SETUPG(IOMUXC_WAKEUP_DIG_GPIO13_IO00, 1, SNVS_PULL_UP + SNVS_DRV_HI + SNVS_SLEW_SLOW, GPIO13, 0, input);

        /* I2C-B */
        SETUP(IOMUXC_GPIO_LPSR_06_LPI2C6_SDA, 1, LPSR_ODE + LPSR_PULL_NONE + LPSR_DRV_NORM + LPSR_SLEW_SLOW);
        SETUP(IOMUXC_GPIO_LPSR_07_LPI2C6_SCL, 1, LPSR_ODE + LPSR_PULL_NONE + LPSR_DRV_NORM + LPSR_SLEW_SLOW);

        /* I2C-C */
        //SETUP(IOMUXC_GPIO_AD_33_LPI2C1_SDA, 1, AD_ODE + AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW); // In conflict with IOMUXC_GPIO_AD_33_ENET_MDIO
        //SETUP(IOMUXC_GPIO_AD_32_LPI2C1_SCL, 1, AD_ODE + AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW); // In conflict with IOMUXC_GPIO_AD_32_ENET_MDC

        /* M.2 Wi-Fi */
        //SETUP(IOMUXC_GPIO_AD_32_GPIO_MUX3_IO31,  0, 0x02U); /* Was SD1_CD (not used now) */
        //SETUP(IOMUXC_GPIO_AD_34_GPIO10_IO01,     0, 0x0EU); /* SD1_VSELECT */
        //SETUP(IOMUXC_GPIO_AD_35_GPIO10_IO02,     0, 0x02U); /* Was SD_PWREN */
        SETUP(IOMUXC_GPIO_SD_B1_00_USDHC1_CMD,   1, SD_PULL_UP   + SD_DRV_HI);
        SETUP(IOMUXC_GPIO_SD_B1_01_USDHC1_CLK,   1, SD_PULL_NONE + SD_DRV_HI);
        SETUP(IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0, 1, SD_PULL_UP   + SD_DRV_HI);
        SETUP(IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1, 1, SD_PULL_UP   + SD_DRV_HI);
        SETUP(IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2, 1, SD_PULL_UP   + SD_DRV_HI);
        SETUP(IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3, 1, SD_PULL_UP   + SD_DRV_HI);
//      IOMUXC_GPR->GPR43 = ((IOMUXC_GPR->GPR43 &
//        (~(IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
//          | IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH(0x8000U) /* GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: 0x8000U */
//        );

