Roberto-Rod/OCC_Main/arm1_mcu_firmware/Faster_FexIO/boards/evkmimxrt1170/apps/arm1_dev_kit/board/pin_mux.c
void BOARD_InitLCDPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();

    /* I2C-C for touch */
    SETUP(IOMUXC_GPIO_AD_33_LPI2C1_SDA, 1, AD_ODE + AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW); // In conflict with IOMUXC_GPIO_AD_33_ENET_MDIO
    SETUP(IOMUXC_GPIO_AD_32_LPI2C1_SCL, 1, AD_ODE + AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW); // In conflict with IOMUXC_GPIO_AD_32_ENET_MDC
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMipiCameraPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitMipiCameraPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  /* GPIO configuration of CAMERA_PWDN on GPIO_AD_26 (pin L14) */
  gpio_pin_config_t CAMERA_PWDN_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_26 (pin L14) */
  GPIO_PinInit(GPIO9, 25U, &CAMERA_PWDN_config);

  /* GPIO configuration of CAMERA_RST on GPIO_DISP_B2_14 (pin A7) */
  gpio_pin_config_t CAMERA_RST_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_14 (pin A7) */
  GPIO_PinInit(GPIO11, 15U, &CAMERA_RST_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_26_GPIO9_IO25,           /* GPIO_AD_26 is configured as GPIO9_IO25 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_14_GPIO11_IO15,     /* GPIO_DISP_B2_14 is configured as GPIO11_IO15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_06_LPI2C6_SDA,         /* GPIO_LPSR_06 is configured as LPI2C6_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_06 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_07_LPI2C6_SCL,         /* GPIO_LPSR_07 is configured as LPI2C6_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_07 */
}

void BOARD_InitCSIPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void BOARD_InitSDCardPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();

    /* This pin is used as an GPIO for Wi-Fi examples it is switched to SD1_VSELECT
     * here so that SDCARD examples will work. */
    SETUP(IOMUXC_GPIO_AD_34_USDHC1_VSELECT, 0, AD_PULL_DOWN + AD_DRV_HI + AD_SLEW_SLOW);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLpuartPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLpuartPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

void BOARD_InitFlexIOPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_03_FLEXIO2_D03,          /* GPIO_AD_03 is configured as FLEXIO2_D03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_07_FLEXIO2_D07,          /* GPIO_AD_07 is configured as FLEXIO2_D07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_08_FLEXIO2_D08,          /* GPIO_AD_08 is configured as FLEXIO2_D08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_09_FLEXIO2_D09,          /* GPIO_AD_09 is configured as FLEXIO2_D09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_10_FLEXIO2_D10,          /* GPIO_AD_10 is configured as FLEXIO2_D10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_11_FLEXIO2_D11,          /* GPIO_AD_11 is configured as FLEXIO2_D11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_12_FLEXIO2_D12,          /* GPIO_AD_12 is configured as FLEXIO2_D12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_13_FLEXIO2_D13,          /* GPIO_AD_13 is configured as FLEXIO2_D13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_14_FLEXIO2_D14,          /* GPIO_AD_14 is configured as FLEXIO2_D14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_15_FLEXIO2_D15,          /* GPIO_AD_15 is configured as FLEXIO2_D15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_16_FLEXIO2_D16,          /* GPIO_AD_16 is configured as FLEXIO2_D16 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_17_FLEXIO2_D17,          /* GPIO_AD_17 is configured as FLEXIO2_D17 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_18_FLEXIO2_D18,          /* GPIO_AD_18 is configured as FLEXIO2_D18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_19_FLEXIO2_D19,          /* GPIO_AD_19 is configured as FLEXIO2_D19 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_20_FLEXIO2_D20,          /* GPIO_AD_20 is configured as FLEXIO2_D20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_21_FLEXIO2_D21,          /* GPIO_AD_21 is configured as FLEXIO2_D21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_22_FLEXIO2_D22,          /* GPIO_AD_22 is configured as FLEXIO2_D22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_23_FLEXIO2_D23,          /* GPIO_AD_23 is configured as FLEXIO2_D23 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

void BOARD_InitLedPin(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void BOARD_I2C_ConfigurePins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void LPI2C1_InitPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();

    /* I2C-C */
    SETUP(IOMUXC_GPIO_AD_33_LPI2C1_SDA, 1, AD_ODE + AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW); // In conflict with IOMUXC_GPIO_AD_33_ENET_MDIO
    SETUP(IOMUXC_GPIO_AD_32_LPI2C1_SCL, 1, AD_ODE + AD_PULL_NONE + AD_DRV_NORM + AD_SLEW_SLOW); // In conflict with IOMUXC_GPIO_AD_32_ENET_MDC
}
void LPI2C1_DeinitPins(void) {
    // Implemented for CMSIS examples but never called
}
void LPSPI1_InitPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void LPSPI1_DeinitPins(void) {
    // Implemented for CMSIS examples but never called
}
void LPUART1_InitPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void LPUART1_DeinitPins(void) {
    // Implemented for CMSIS examples but never called
}
void BOARD_InitArduinoUARTPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void BOARD_InitPinsM2(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void BOARD_InitM2UARTPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}
void BOARD_InitM2CodecPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();
}

void BOARD_InitEnetQOSPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();

