Roberto-Rod/OCC_Main/arm1_mcu_firmware/Faster_FexIO/boards/evkmimxrt1170/apps/arm1_dev_kit/board/pin_mux.c
    /* ENET QOS - replaces the ENET 1G functionality */
    SETUP(IOMUXC_GPIO_DISP_B1_00_ENET_QOS_RX_EN,     0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_01_ENET_QOS_RX_CLK,    0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_02_ENET_QOS_RX_DATA00, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_03_ENET_QOS_RX_DATA01, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_04_ENET_QOS_RX_DATA02, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_05_ENET_QOS_RX_DATA03, 0U, DISP_B1_PULL_DOWN + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_06_ENET_QOS_TX_DATA03, 0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_07_ENET_QOS_TX_DATA02, 0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_08_ENET_QOS_TX_DATA01, 0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_09_ENET_QOS_TX_DATA00, 0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_10_ENET_QOS_TX_EN,     0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_DISP_B1_11_ENET_QOS_TX_CLK,    0U, DISP_B1_PULL_NONE + DISP_B1_DRV_HI);
    SETUP(IOMUXC_GPIO_EMC_B2_19_ENET_QOS_MDC,        0U, EMC_PULL_DOWN + EMC_DRV_HI);
    SETUP(IOMUXC_GPIO_EMC_B2_20_ENET_QOS_MDIO,       0U, EMC_PULL_DOWN + EMC_DRV_HI);
}

void BOARD_InitSEMCPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();

    /*
     * The SEMC pins are normally setup by either the DCD or by the debugger's
     * initialization scripts. This function MUST NEVER be called from code
     * running in SDRAM as it will corrupt the data.
     */

    SETUP(IOMUXC_GPIO_EMC_B1_00_SEMC_DATA00, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_01_SEMC_DATA01, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_02_SEMC_DATA02, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_03_SEMC_DATA03, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_04_SEMC_DATA04, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_05_SEMC_DATA05, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_06_SEMC_DATA06, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_07_SEMC_DATA07, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_08_SEMC_DM00,   0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_09_SEMC_ADDR00, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_10_SEMC_ADDR01, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_11_SEMC_ADDR02, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_12_SEMC_ADDR03, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_13_SEMC_ADDR04, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_14_SEMC_ADDR05, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_15_SEMC_ADDR06, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_16_SEMC_ADDR07, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_17_SEMC_ADDR08, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_18_SEMC_ADDR09, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_19_SEMC_ADDR11, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_20_SEMC_ADDR12, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_21_SEMC_BA0,    0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_22_SEMC_BA1,    0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_23_SEMC_ADDR10, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_24_SEMC_CAS,    0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_25_SEMC_RAS,    0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_26_SEMC_CLK,    0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_27_SEMC_CKE,    0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_28_SEMC_WE,     0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_29_SEMC_CS0,    0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_30_SEMC_DATA08, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_31_SEMC_DATA09, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_32_SEMC_DATA10, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_33_SEMC_DATA11, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_34_SEMC_DATA12, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_35_SEMC_DATA13, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_36_SEMC_DATA14, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_37_SEMC_DATA15, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_38_SEMC_DM01,   0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B1_39_SEMC_DQS,    1U, EMC_DRV_HI + EMC_PULL_DOWN);
    //SETUP(IOMUXC_GPIO_EMC_B1_40_SEMC_RDY,    0U, EMC_DRV_HI + EMC_PULL_DOWN); // Used as LPUART6_TXD
    //SETUP(IOMUXC_GPIO_EMC_B1_41_SEMC_CSX00,  0U, EMC_DRV_HI + EMC_PULL_DOWN); // Used as LPUART6_RXD
    SETUP(IOMUXC_GPIO_EMC_B2_00_SEMC_DATA16, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_01_SEMC_DATA17, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_02_SEMC_DATA18, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_03_SEMC_DATA19, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_04_SEMC_DATA20, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_05_SEMC_DATA21, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_06_SEMC_DATA22, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_07_SEMC_DATA23, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_08_SEMC_DM02,   0U, EMC_DRV_HI + EMC_PULL_UP);
    SETUP(IOMUXC_GPIO_EMC_B2_09_SEMC_DATA24, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_10_SEMC_DATA25, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_11_SEMC_DATA26, 0U, EMC_DRV_HI + EMC_PULL_UP);
    SETUP(IOMUXC_GPIO_EMC_B2_12_SEMC_DATA27, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_13_SEMC_DATA28, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_14_SEMC_DATA29, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_15_SEMC_DATA30, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_16_SEMC_DATA31, 0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_17_SEMC_DM03,   0U, EMC_DRV_HI + EMC_PULL_DOWN);
    SETUP(IOMUXC_GPIO_EMC_B2_18_SEMC_DQS4,   0U, EMC_DRV_HI + EMC_PULL_DOWN);
    //SETUP(IOMUXC_GPIO_EMC_B2_19_SEMC_CLKX00, 0U, EMC_DRV_HI + EMC_PULL_DOWN); // Used as MDC for ENET 1G or QOS
    //SETUP(IOMUXC_GPIO_EMC_B2_20_SEMC_CLKX01, 0U, EMC_DRV_HI + EMC_PULL_DOWN); // Used as MDIO for ENET 1G or QOS
}

void BOARD_InitParallelRGBPins(void) {
    BOARD_InitPins_uCOM_Carrier_Board();

